projects/yelp/app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants"
---
  def index
    @restaurant = Restaurant.all

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    check_user_is_signed_in
    @restaurant = Restaurant.find(params[:id])

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
    check_user_is_signed_in
    @restaurant = Restaurant.find(params[:id])

SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 1]]
---
  def set_average_rating
    @ratings = 0
    @restaurant.reviews.each { |review| @ratings += review.rating }