projects/yelp/app/controllers/reviews_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("author", "email", "rating", "comments", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["author", "Rob"], ["email", "rob@rob.com"], ["rating", 3], ["comments", "I ate"], ["restaurant_id", 1], ["created_at", "2017-12-14 11:52:18.447489"], ["updated_at", "2017-12-14 11:52:18.447489"]]
---
  def create
    check_user_is_signed_in
    @restaurant = Restaurant.find(params[:restaurant_id])
    @review = @restaurant.reviews.create(review_params)